#### ⚙️ Terraform Plan for `infra/provisioning/deploy`
<details><summary>Show Plan</summary>

```

module.provisioning.tls_private_key.key_pair: Refreshing state... [id=d80b83e85cb2b58cf195eb76e33e422740f195ce]
module.provisioning.data.aws_availability_zones.available: Reading...
module.provisioning.aws_placement_group.web: Refreshing state... [id=acropolis-infra]
module.provisioning.aws_secretsmanager_secret.ssh_private_key: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:017845957019:secret:acropolis-infra-ssh-private-key-LQBNj9]
module.provisioning.data.aws_ami.debian-13: Reading...
module.provisioning.aws_key_pair.key_pair: Refreshing state... [id=acropolis-infra]
module.provisioning.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d428a91facf89674]
module.provisioning.aws_secretsmanager_secret.instance_ip: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:017845957019:secret:acropolis-infra-instance-ip-NC0Y70]
module.provisioning.data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
module.provisioning.data.aws_ami.debian-13: Read complete after 1s [id=ami-0c5d3777e994cd6cc]
module.provisioning.aws_secretsmanager_secret_version.ssh_private_key_version: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:017845957019:secret:acropolis-infra-ssh-private-key-LQBNj9|terraform-20251018144147184800000004]
module.provisioning.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b243cfc28f60abdb]
module.provisioning.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0766978b11c9dc107]
module.provisioning.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-085311e30ea223409]
module.provisioning.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-034e788daffd2ef28]
module.provisioning.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0246c5fbd91ebd6d9]
module.provisioning.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-027c39a8aafbc8f04]
module.provisioning.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-07b05b03791e7e181]
module.provisioning.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-095409357c65508eb]
module.provisioning.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0bd9177ac6e3c6ebd]
module.provisioning.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0916972010fd760f3]
module.provisioning.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0419401a8ff961675]
module.provisioning.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-027c39a8aafbc8f041080289494]
module.provisioning.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c3fc560fe55213fd]
module.provisioning.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-050faf85e5af0678f]
module.provisioning.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04cf44a7856af4e6a]
module.provisioning.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00086a55d9bfd715a]
module.provisioning.aws_security_group.instance_sg: Refreshing state... [id=sg-0e93af854bec430f9]
module.provisioning.module.ec2_instance.data.aws_partition.current: Reading...
module.provisioning.aws_network_interface.this: Refreshing state... [id=eni-0cde20fd8a6f4eae5]
module.provisioning.module.ec2_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.provisioning.module.ec2_instance.data.aws_subnet.this[0]: Reading...
module.provisioning.module.ec2_instance.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.provisioning.module.ec2_instance.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=1256122602]
module.provisioning.module.ec2_instance.aws_iam_role.this[0]: Refreshing state... [id=acropolis-infra-20251017162554469300000005]
module.provisioning.module.ec2_instance.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-095409357c65508eb]
module.provisioning.module.ec2_instance.aws_security_group.this[0]: Refreshing state... [id=sg-0a645fdc758bd9409]
module.provisioning.module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv4_default"]: Refreshing state... [id=sgr-0867211b97c313fab]
module.provisioning.module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv6_default"]: Refreshing state... [id=sgr-0ed0fed8317e9d03e]
module.provisioning.module.ec2_instance.aws_iam_role_policy_attachment.this["AdministratorAccess"]: Refreshing state... [id=acropolis-infra-20251017162554469300000005/arn:aws:iam::aws:policy/AdministratorAccess]
module.provisioning.module.ec2_instance.aws_iam_instance_profile.this[0]: Refreshing state... [id=acropolis-infra-20251017162555076700000007]
module.provisioning.module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-04e5e1e6e31e2df4a]
module.provisioning.module.ec2_instance.aws_eip.this[0]: Refreshing state... [id=eipalloc-00562b8c3ef7bc064]
module.provisioning.aws_secretsmanager_secret_version.instance_ip_version: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:017845957019:secret:acropolis-infra-instance-ip-NC0Y70|terraform-20251018144147173500000003]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.provisioning.module.ec2_instance.aws_instance.this[0] has been deleted
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0c5d3777e994cd6cc" -> null
      - arn                                  = "arn:aws:ec2:eu-west-1:017845957019:instance/i-04e5e1e6e31e2df4a" -> null
      - availability_zone                    = "eu-west-1a" -> null
      - id                                   = "i-04e5e1e6e31e2df4a" -> null
      - instance_state                       = "running" -> null
      - ipv6_addresses                       = [] -> null
      - primary_network_interface_id         = "eni-01e48b450194c56ba" -> null
      - private_dns                          = "ip-10-0-15-65.eu-west-1.compute.internal" -> null
      - private_ip                           = "10.0.15.65" -> null
      - public_dns                           = "ec2-52-50-107-23.eu-west-1.compute.amazonaws.com" -> null
      - public_ip                            = "52.50.107.23" -> null
        tags                                 = {
            "Name"              = "acropolis-infra"
            "account_id_secret" = "017845957019"
            "account_name"      = "aymenxsegni"
            "deployed_by"       = "aymen-segni"
            "environment"       = "test"
        }
      - tags_all                             = {
          - "Name"              = "acropolis-infra"
          - "account_id_secret" = "017845957019"
          - "account_name"      = "aymenxsegni"
          - "deployed_by"       = "aymen-segni"
          - "environment"       = "test"
        } -> null
        # (29 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = true -> null
          - iops                  = 3000 -> null
          - kms_key_id            = "arn:aws:kms:eu-west-1:017845957019:key/dbfe64af-e730-47ac-9814-73ff88f7f503" -> null
          - tags                  = {
              - "Name" = "my-root-block"
            } -> null
          - tags_all              = {
              - "Name"              = "my-root-block"
              - "account_id_secret" = "017845957019"
              - "account_name"      = "aymenxsegni"
              - "deployed_by"       = "aymen-segni"
              - "environment"       = "test"
            } -> null
          - throughput            = 200 -> null
          - volume_id             = "vol-0b7d6b4de9efdc6f8" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp3" -> null
        }

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.provisioning.module.ec2_instance.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                       = "eipalloc-00562b8c3ef7bc064"
      + instance                 = (known after apply)
        tags                     = {
            "account_id_secret" = "017845957019"
            "account_name"      = "aymenxsegni"
            "deployed_by"       = "aymen-segni"
            "environment"       = "test"
        }
        # (17 unchanged attributes hidden)
    }

  # module.provisioning.module.ec2_instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0c5d3777e994cd6cc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "eu-west-1a"
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + hibernation                          = true
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "acropolis-infra-20251017162555076700000007"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "acropolis-infra"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = "acropolis-infra"
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "eu-west-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-095409357c65508eb"
      + tags                                 = {
          + "Name"              = "acropolis-infra"
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
      + tags_all                             = {
          + "Name"              = "acropolis-infra"
          + "account_id_secret" = "017845957019"
          + "account_name"      = "aymenxsegni"
          + "deployed_by"       = "aymen-segni"
          + "environment"       = "test"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0a645fdc758bd9409",
          + "sg-0e93af854bec430f9",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + credit_specification {}

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "my-root-block"
            }
          + tags_all              = (known after apply)
          + throughput            = 200
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ instance_arn         = "arn:aws:ec2:eu-west-1:017845957019:instance/i-04e5e1e6e31e2df4a" -> (known after apply)
  ~ instance_id          = "i-04e5e1e6e31e2df4a" -> (known after apply)
  ~ instance_private_dns = "ip-10-0-15-65.eu-west-1.compute.internal" -> (known after apply)
  ~ instance_public_dns  = "ec2-52-50-107-23.eu-west-1.compute.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pushed by: @AymenSegni, Action: `pull_request`*